trade_exp/src/InformationRegisters/ТоварныеОграничения/ТоварныеОграничения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварныеОграничения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>НормаПотребления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>УпаковкаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ОбеспечениеЗаказовПриПоддержанииЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СреднедневноеПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СреднееОтклонениеПотребления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МетодОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СтраховоеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МинимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>АлгоритмРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="79e85354-95b1-4fa4-912d-e98823eec07c">
    <name>ПределМИН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="33ce8317-c35e-4bb4-9e22-34e5046989ad">
    <name>ПределМАКС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЕстьРекомендацияПоИзменению</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭтоГруппировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРасчетаРекомендаций</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЭтоДействующийПараметр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="78280a32-83cd-4d53-9f8a-a6d612ce998a">
    <name>ГруппировкаТоварныхОграничений</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/МетодыОбеспеченияПотребностей/МетодыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="879216cd-58f8-4ae5-b494-20f33e3f24f9">
  <name>МетодыОбеспеченияПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b74f2748-7203-41df-9f30-f156d7a65a40">
    <name>ЗаказПодЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="123aad71-3991-4419-bc74-de443eb42763">
    <name>ПоддержаниеЗапасаМинМакс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f34bc2fd-7730-4a0a-8c87-9b96562b60a7">
    <name>ПоддержаниеЗапасаНаСрокПоНорме</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dbf7de1d-d86f-424f-9a63-ba8f28985133">
    <name>ПоддержаниеЗапасаНаСрокПоСтатистике</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d9d89bb4-f2d8-494d-98a7-692ea86d7c8f">
    <name>ПоддержаниеЗапасаПоАлгоритму</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ОбеспечениеЗаказовПриПоддержанииЗапаса/ОбеспечениеЗаказовПриПоддержанииЗапаса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОбеспечениеЗаказовПриПоддержанииЗапаса</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НезависимоОтЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗаСчетЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/InformationRegisters/ТоварныеОграничения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Добавляет поддержание запаса по методу "Расчет по алгоритму" для товара на складе или группировки.
//
// Параметры:
//		КлючиЗаписи			- Массив, Структура - КлючЗаписи (см. КлючЗаписиГруппировки(), КлючЗаписиНоменклатуры(),
//								КлючЗаписиХарактеристики() ) или массив таких записей.
//		ПараметрыМинМакс	- Структура - Параметры поддержания запаса (ПараметрыРасчетПоСтатистике()).
//
Процедура ДобавитьПоддержаниеЗапасаРасчетПоАлгоритму(КлючиЗаписи, ПараметрыПоАлгоритму) Экспорт
	
	Если Тип(КлючиЗаписи) = Тип("Структура") Тогда
		Ключ = КлючиЗаписи;
		КлючиЗаписи = Новый Массив(1);
		КлючиЗаписи[0] = Ключ;
	КонецЕсли;
	
	ПараметрыДляЗаписи = ПустыеПараметрыТоварногоОграничения();
	// изменение
	ПараметрыДляЗаписи.Вставить("АлгоритмРасчета",Справочники.оп_АлгоритмыОбеспеченияПотребностей.ПустаяСсылка());
	ЗаполнитьЗначенияСвойств(ПараметрыДляЗаписи, ПараметрыПоАлгоритму);
	ПараметрыДляЗаписи.МетодОбеспеченияПотребностей = Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаПоАлгоритму;
	
	ТаблицаТоваров		= ТаблицаТоваров();
	ТаблицаГруппировок	= ТаблицаГруппировок();
	Для каждого Ключ Из КлючиЗаписи Цикл
		Если Ключ.ТипКлюча = "ДетальнаяНастройка" Тогда
			ЗаписьТаблицы = ТаблицаТоваров.Добавить();
			ЗаписьТаблицы.Номенклатура		= Ключ.Номенклатура;
			ЗаписьТаблицы.Характеристика	= Ключ.Характеристика;
			ЗаписьТаблицы.Склад				= Ключ.Склад;
		ИначеЕсли Ключ.ТипКлюча = "ОбщаяНастройка" Тогда
			ЗаписьТаблицы = ТаблицаТоваров.Добавить();
			ЗаписьТаблицы.Номенклатура		= Ключ.Номенклатура;
			ЗаписьТаблицы.Склад				= Ключ.Склад;
		ИначеЕсли Ключ.ТипКлюча = "Группировка" Тогда
			ЗаписьТаблицы = ТаблицаГруппировок.Добавить();
			ЗаписьТаблицы.Группировка		= Ключ.Группировка;
		Иначе
			ВызватьИсключение НСтр("ru = 'Недопустимый тип ключа записи!'");;
		КонецЕсли;
	КонецЦикла;
	
	Записать(ТаблицаТоваров, ТаблицаГруппировок, ПараметрыДляЗаписи, Истина);
	
КонецПроцедуры

// Функция-конструктор структуры, описывающей параметры поддержания запаса "Расчет по алгоритму".
//
// Возвращаемое значение:
//		Структура - Структура с полями:
//			СтраховоеКоличествоЗапаса				- Число.
//			ОбеспечениеЗаказовПриПоддержанииЗапаса	- Перечисление.ОбеспечениеЗаказовПриПоддержанииЗапаса.
//
Функция ПараметрыРасчетПоАлгоритму() Экспорт
	Параметры = Новый Структура();
	Параметры.Вставить("АлгоритмРасчета",	Справочники.оп_АлгоритмыОбеспеченияПотребностей.ПустаяСсылка());
	Параметры.Вставить("ОбеспечениеЗаказовПриПоддержанииЗапаса",
		Перечисления.ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов);
	Параметры.Вставить("ИмяПараметраЗаполнения",	Неопределено);
	Возврат Параметры;
КонецФункции
&Вместо ("ПараметрыПоддержанияЗапасаТовараНаСкладе")
Функция оп_ПараметрыПоддержанияЗапасаТовараНаСкладе(Ключ) Экспорт
	
	Если Ключ.Свойство("Группировка") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТоварныеОграничения.ГруппировкаТоварныхОграничений,
			|	ТоварныеОграничения.СтраховоеКоличествоЗапаса,
			|	ТоварныеОграничения.МинимальноеКоличествоЗапаса,
			|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса,
			|	ТоварныеОграничения.НормаПотребления,
			|	ТоварныеОграничения.МетодОбеспеченияПотребностей,
			|	ТоварныеОграничения.УпаковкаЗаказа,
			// изменение
			|	ТоварныеОграничения.АлгоритмРасчета,
			|	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса,
			|	ТоварныеОграничения.ПределМИН,
			|	ТоварныеОграничения.ПределМАКС,
			|	""ДЛЯ_ГРУППЫ_ТОВАРОВ"" КАК СпособУказанияНастройки
			|ИЗ
			|	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
			|ГДЕ
			|	ТоварныеОграничения.ГруппировкаТоварныхОграничений = &ГруппировкаТоварныхОграничений
			|	И ТоварныеОграничения.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|	И ТоварныеОграничения.ЭтоДействующийПараметр";
		
		Запрос.УстановитьПараметр("ГруппировкаТоварныхОграничений", Ключ.Группировка);
		Выборка = Запрос.Выполнить().Выбрать();
	
	Иначе
	
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Номенклатура   КАК Номенклатура,
		|	&Характеристика КАК Характеристика,
		|	&Склад          КАК Склад
		|ПОМЕСТИТЬ ВтКлючЗаписи
		|;
		|
		|////////////////////////////////////////
		|ВЫБРАТЬ
		|	&СпособУказанияНастройки                                   КАК СпособУказанияНастройки,
		|	ТоварныеОграничения.ГруппировкаТоварныхОграничений                            КАК ГруппировкаТоварныхОграничений,
		|	ТоварныеОграничения.СтраховоеКоличествоЗапаса              КАК СтраховоеКоличествоЗапаса,
		|	ТоварныеОграничения.МинимальноеКоличествоЗапаса            КАК МинимальноеКоличествоЗапаса,
		|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса           КАК МаксимальноеКоличествоЗапаса,
		|	ТоварныеОграничения.НормаПотребления                       КАК НормаПотребления,
		|	ТоварныеОграничения.МетодОбеспеченияПотребностей           КАК МетодОбеспеченияПотребностей,
		|	ТоварныеОграничения.УпаковкаЗаказа                         КАК УпаковкаЗаказа,
			// изменение
		|	ТоварныеОграничения.АлгоритмРасчета                        КАК АлгоритмРасчета,
		|	ТоварныеОграничения.ПределМИН                              КАК ПределМИН,
		|	ТоварныеОграничения.ПределМАКС                             КАК ПределМАКС,
		|	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса КАК ОбеспечениеЗаказовПриПоддержанииЗапаса
		|ИЗ
		|	ВтКлючЗаписи КАК КлючЗаписи
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
		|		ПО &ПодстановкаТоварногоОграничения";
		
		Запрос.Текст = ПодставитьСоединение(
			Запрос.Текст,
			"ПодстановкаТоварногоОграничения",
			"КлючЗаписи.Номенклатура,КлючЗаписи.Характеристика,КлючЗаписи.Склад");
			
		// Вычисление поля "Способ указания настройки", использует служебные таблицы функции ПодставитьСоединение(...).
		ПодстановкаСпособУказанияНастройки =
			"ВЫБОР КОГДА НЕ НастройкаДетальная.Номенклатура ЕСТЬ NULL ТОГДА
			|			ВЫБОР КОГДА НастройкаДетальная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|					И НастройкаДетальная.Номенклатура.ИспользованиеХарактеристик 
			|					<> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) ТОГДА
			|				""ДЛЯ_ХАРАКТЕРИСТИК_ТОВАРА""
			|			ИНАЧЕ
			|				""ДЛЯ_ТОВАРА""
			|			КОНЕЦ
			|		КОГДА НЕ ПринадлежностьГруппе.Номенклатура ЕСТЬ NULL
			|				ИЛИ НЕ НастройкаГруппировкиОбщейНастройки.Номенклатура ЕСТЬ NULL ТОГДА
			|			""ДЛЯ_ГРУППЫ_ТОВАРОВ""
			|		КОГДА НЕ НастройкаОбщая.Номенклатура ЕСТЬ NULL ТОГДА
			|			""ДЛЯ_ХАРАКТЕРИСТИК_ТОВАРА""
			|		ИНАЧЕ
			|			NULL
			|	КОНЕЦ";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СпособУказанияНастройки", ПодстановкаСпособУказанияНастройки);
		
		Запрос.УстановитьПараметр("Номенклатура",   Ключ.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Ключ.Характеристика);
		Запрос.УстановитьПараметр("Склад",          Ключ.Склад);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
	КонецЕсли;
	
	ЗначениеНастройки = Новый Структура();
	ЗначениеНастройки.Вставить("СпособУказанияНастройки", "НЕ_УКАЗАНА");
	ЗначениеНастройки.Вставить("ГруппировкаТоварныхОграничений", Справочники.ГруппировкиТоварныхОграничений.ПустаяСсылка());
	ЗначениеНастройки.Вставить("МетодОбеспеченияПотребностей", Перечисления.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ);
	ЗначениеНастройки.Вставить("СтраховоеКоличествоЗапаса", 0.000);
	ЗначениеНастройки.Вставить("МинимальноеКоличествоЗапаса", 0.000);
	ЗначениеНастройки.Вставить("МаксимальноеКоличествоЗапаса", 0.000);
	ЗначениеНастройки.Вставить("ПределМИН", 0.000);
	ЗначениеНастройки.Вставить("ПределМАКС", 0.000);
	ЗначениеНастройки.Вставить("НормаПотребления", 0.000);
	ЗначениеНастройки.Вставить("УпаковкаЗаказа", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	// изменение
	ЗначениеНастройки.Вставить("АлгоритмРасчета", Справочники.оп_АлгоритмыОбеспеченияПотребностей.ПустаяСсылка());
	ЗначениеНастройки.Вставить("ОбеспечениеЗаказовПриПоддержанииЗапаса", Перечисления.ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов);
	
	Если Выборка.Следующий() И Выборка.СпособУказанияНастройки <> NULL Тогда
		
		ЗаполнитьЗначенияСвойств(ЗначениеНастройки, Выборка);
		
	КонецЕсли;
	
	Если ЗначениеНастройки.МетодОбеспеченияПотребностей <> Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаНаСрокПоНорме Тогда
		ЗначениеНастройки.НормаПотребления = 0.000;
	КонецЕсли;
	
	Возврат ЗначениеНастройки;
	
КонецФункции
&ИзменениеИКонтроль ("Записать")
Функция оп_Записать(ТаблицаТоваров, ТаблицаГруппировок, ПараметрыДляЗаписи, ОбнулятьРанееЗаданныйМинМакс,
			МетодыДляОтбора = Неопределено)
	
	ТаблицаТоваров.Свернуть("Номенклатура,Характеристика,Склад");
	ТаблицаГруппировок.Свернуть("ГруппировкаТоварныхОграничений");
	
	УстановкаГруппировки = ПараметрыДляЗаписи.Свойство("ГруппировкаТоварныхОграничений");
	ИсключениеИзГруппы = УстановкаГруппировки И ПараметрыДляЗаписи.ГруппировкаТоварныхОграничений.Пустая();
	
	НачатьТранзакцию();
	Попытка
	
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТоварныеОграничения");
		ЭлементБлокировки.ИсточникДанных = ТаблицаТоваров;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",		"Номенклатура");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика",	"Характеристика");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад",			"Склад");
		
		Для каждого СтрокаТаблицы Из ТаблицаГруппировок Цикл
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТоварныеОграничения");
			ЭлементБлокировки.УстановитьЗначение("Номенклатура",	Справочники.Номенклатура.ПустаяСсылка());
			ЭлементБлокировки.УстановитьЗначение("Склад",			Справочники.Склады.ПустаяСсылка());
			ЭлементБлокировки.УстановитьЗначение("ГруппировкаТоварныхОграничений",		СтрокаТаблицы.ГруппировкаТоварныхОграничений);
		КонецЦикла;
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ТаблицаТоваров.Номенклатура   КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика КАК Характеристика,
			|	ТаблицаТоваров.Склад          КАК Склад
			|ПОМЕСТИТЬ ВтТаблицаТоваров
			|ИЗ
			|	&ТаблицаТоваров КАК ТаблицаТоваров
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаГруппировок.ГруппировкаТоварныхОграничений КАК ГруппировкаТоварныхОграничений
			|ПОМЕСТИТЬ ВтТаблицаГруппировок
			|ИЗ
			|	&ТаблицаГруппировок КАК ТаблицаГруппировок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаТоваров.Номенклатура     КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика   КАК Характеристика,
			|	ТаблицаТоваров.Склад            КАК Склад,
			|	ТоварныеОграничения.ГруппировкаТоварныхОграничений КАК ГруппировкаТоварныхОграничений,
			|
			|	ЕСТЬNULL(ТоварныеОграниченияГруппировки.МетодОбеспеченияПотребностей,
			|		ТоварныеОграничения.МетодОбеспеченияПотребностей)             КАК МетодОбеспеченияПотребностей,
			|	ЕСТЬNULL(ТоварныеОграниченияГруппировки.МинимальноеКоличествоЗапаса,
			|		ТоварныеОграничения.МинимальноеКоличествоЗапаса)              КАК МинимальноеКоличествоЗапаса,
			|	ЕСТЬNULL(ТоварныеОграниченияГруппировки.МаксимальноеКоличествоЗапаса,
			|		ТоварныеОграничения.МаксимальноеКоличествоЗапаса)             КАК МаксимальноеКоличествоЗапаса,
			|	ЕСТЬNULL(ТоварныеОграниченияГруппировки.НормаПотребления,
			|		ТоварныеОграничения.НормаПотребления)                         КАК НормаПотребления,
			|	ЕСТЬNULL(ТоварныеОграниченияГруппировки.СтраховоеКоличествоЗапаса,
			|		ТоварныеОграничения.СтраховоеКоличествоЗапаса)                КАК СтраховоеКоличествоЗапаса,
			|	ЕСТЬNULL(ТоварныеОграниченияГруппировки.ОбеспечениеЗаказовПриПоддержанииЗапаса,
			|		ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса)   КАК ОбеспечениеЗаказовПриПоддержанииЗапаса,
			|
			|	ТоварныеОграничения.УпаковкаЗаказа               КАК УпаковкаЗаказа,
			|	ТоварныеОграничения.СреднедневноеПотребление     КАК СреднедневноеПотребление,
			|	ТоварныеОграничения.СреднееОтклонениеПотребления КАК СреднееОтклонениеПотребления,
			|	ТоварныеОграничения.ЕстьРекомендацияПоИзменению  КАК ЕстьРекомендацияПоИзменению,
			|	ТоварныеОграничения.ДатаРасчетаРекомендаций      КАК ДатаРасчетаРекомендаций,
			|	ТоварныеОграничения.РеквизитДопУпорядочивания    КАК РеквизитДопУпорядочивания,
			|
			|	ТаблицаТоваров.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		ИЛИ ТаблицаТоваров.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) КАК ЭтоДетальнаяЗапись,
			#Удаление
			|	ЛОЖЬ КАК ЭтоГруппировка
			#КонецУдаления
			#Вставка
			|	ЛОЖЬ КАК ЭтоГруппировка,
			|	ТоварныеОграничения.ПределМИН КАК ПределМИН,
			|	ТоварныеОграничения.ПределМАКС КАК ПределМАКС
			#КонецВставки
			|ИЗ
			|	ВтТаблицаТоваров КАК ТаблицаТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
			|		ПО ТаблицаТоваров.Номенклатура = ТоварныеОграничения.Номенклатура
			|			И ТаблицаТоваров.Характеристика = ТоварныеОграничения.Характеристика
			|			И ТаблицаТоваров.Склад = ТоварныеОграничения.Склад
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграниченияГруппировки
			|		ПО (ТоварныеОграничения.ГруппировкаТоварныхОграничений = ТоварныеОграниченияГруппировки.ГруппировкаТоварныхОграничений)
			|			И (ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) = ТоварныеОграниченияГруппировки.Номенклатура)
			|			И (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) = ТоварныеОграниченияГруппировки.Склад)
			|ГДЕ
			|	(&БезОтбораПоМетодам
			|			ИЛИ ТоварныеОграничения.МетодОбеспеченияПотребностей В (&МетодыОбеспеченияПотребностей))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
			|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
			|	ТаблицаГруппировок.ГруппировкаТоварныхОграничений,
			|
			|	ТоварныеОграничения.МетодОбеспеченияПотребностей,
			|	ТоварныеОграничения.МинимальноеКоличествоЗапаса,
			|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса,
			|	ТоварныеОграничения.НормаПотребления,
			|	ТоварныеОграничения.СтраховоеКоличествоЗапаса,
			|	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса,
			|
			|	ТоварныеОграничения.УпаковкаЗаказа,
			|	ТоварныеОграничения.СреднедневноеПотребление,
			|	ТоварныеОграничения.СреднееОтклонениеПотребления,
			|	ТоварныеОграничения.ЕстьРекомендацияПоИзменению,
			|	ТоварныеОграничения.ДатаРасчетаРекомендаций,
			|	ТоварныеОграничения.РеквизитДопУпорядочивания,
			|
			|	ЛОЖЬ,
			#Удаление
			|	ИСТИНА
			#КонецУдаления
			#Вставка
			|	ИСТИНА,
			|	ТоварныеОграничения.ПределМИН КАК ПределМИН,
			|	ТоварныеОграничения.ПределМАКС КАК ПределМАКС
			#КонецВставки
			|ИЗ
			|	ВтТаблицаГруппировок КАК ТаблицаГруппировок
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
			|		ПО ТаблицаГруппировок.ГруппировкаТоварныхОграничений = ТоварныеОграничения.ГруппировкаТоварныхОграничений
			|			И (ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) = ТоварныеОграничения.Номенклатура)
			|			И (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) = ТоварныеОграничения.Склад)
			|ГДЕ
			|	(&БезПропускаГруппировки
			|			ИЛИ ТоварныеОграничения.МетодОбеспеченияПотребностей ЕСТЬ NULL)
			|	И (&БезОтбораПоМетодам
			|			ИЛИ ТоварныеОграничения.МетодОбеспеченияПотребностей В (&МетодыОбеспеченияПотребностей))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаТоваров.Номенклатура     КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика   КАК Характеристика
			|ИЗ
			|	ВтТаблицаТоваров КАК ТаблицаТоваров
			|ГДЕ
			|	ТаблицаТоваров.Склад.ЦеховаяКладовая";
		
		Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
		Запрос.УстановитьПараметр("ТаблицаГруппировок", ТаблицаГруппировок);
		
		Запрос.УстановитьПараметр("БезОтбораПоМетодам", МетодыДляОтбора = Неопределено);
		Запрос.УстановитьПараметр("МетодыОбеспеченияПотребностей", МетодыДляОтбора);
		
		// Если при установке группировки уже есть запись группировки, не трогаем её
		Запрос.УстановитьПараметр("БезПропускаГруппировки", НЕ УстановкаГруппировки);
		
		УстановитьПривилегированныйРежим(Истина);
		Результат = Запрос.ВыполнитьПакет();
		УстановитьПривилегированныйРежим(Ложь);
		Выборка = Результат[2].Выбрать();
		ВыборкаДляОбновленияДопРеквизита = Результат[3].Выбрать();
		
		НаборЗаписей = РегистрыСведений.ТоварныеОграничения.СоздатьНаборЗаписей();
		ЗаписьРегистра = НаборЗаписей.Добавить();
		КоличествоЗаписей = 0;
		#Вставка
		ЗаписьРегистра.Пользователь=Пользователи.ТекущийПользователь();
		ЗаписьРегистра.Датаизменения=ТекущаяДата();
		#КонецВставки
		ОбщиеНастройки = ТаблицаОбщихНастроек();
		Группировки = ТаблицаСлужебныхГруппировок();
		
		ВсеРесурсы = "СтраховоеКоличествоЗапаса,МинимальноеКоличествоЗапаса,МаксимальноеКоличествоЗапаса,
			|НормаПотребления,МетодОбеспеченияПотребностей,УпаковкаЗаказа,ОбеспечениеЗаказовПриПоддержанииЗапаса,
			|СреднедневноеПотребление,СреднееОтклонениеПотребления";
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка);
			
			Если НЕ ИсключениеИзГруппы Тогда // при исключении из группы берем параметры группировки
				ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ПараметрыДляЗаписи);
				Если Не ОбнулятьРанееЗаданныйМинМакс
					И Выборка.МетодОбеспеченияПотребностей = ЗаписьРегистра.МетодОбеспеченияПотребностей Тогда
						ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка, ВсеРесурсы);
				КонецЕсли;
			Иначе
				ЗаписьРегистра.ГруппировкаТоварныхОграничений = Справочники.ГруппировкиТоварныхОграничений.ПустаяСсылка();
			КонецЕсли;
			
			Если УстановкаГруппировки И Выборка.ЭтоГруппировка Тогда // записи для группировки нет, заполним по умолчанию
				ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ПараметрыМинМакс());
				ЗаписьРегистра.МетодОбеспеченияПотребностей = Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаМинМакс;
			КонецЕсли;
			
			ЗаписьРегистра.ЭтоДействующийПараметр = ЗначениеЗаполнено(Выборка.Характеристика)
				ИЛИ ЗаписьРегистра.МетодОбеспеченияПотребностей <> Перечисления.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ;
				
			Если Выборка.ЭтоДетальнаяЗапись Тогда
				ОбновитьРекомендациюПоИзменениюЗаписиРегистра(ЗаписьРегистра);
				
				Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
					ЗапомнитьОбщуюНастройкуДляОбновления(ОбщиеНастройки, Выборка.Номенклатура, Выборка.Склад);
				КонецЕсли;
			ИначеЕсли НЕ Выборка.ЭтоГруппировка Тогда // общая настройка для номенклатуры
				ЗапомнитьОбщуюНастройкуДляОбновления(ОбщиеНастройки, Выборка.Номенклатура, Выборка.Склад);
			КонецЕсли;
			
			// Запоминаем для каких записей группировки нужно обновить реквизит ЕстьРекомендацияПоИзменению.
			Если УстановкаГруппировки И НЕ Выборка.ЭтоГруппировка Тогда
				ЗапомнитьГруппировкуДляОбновления(Группировки, Выборка.ГруппировкаТоварныхОграничений, Выборка.Склад, Ложь);
				ЗапомнитьГруппировкуДляОбновления(Группировки, ПараметрыДляЗаписи.ГруппировкаТоварныхОграничений, Выборка.Склад,
					ЗаписьРегистра.ЕстьРекомендацияПоИзменению);
			КонецЕсли;
			
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика);
			НаборЗаписей.Отбор.Склад.Установить(Выборка.Склад);
			Если Выборка.ЭтоГруппировка Тогда
				НаборЗаписей.Отбор.ГруппировкаТоварныхОграничений.Установить(Выборка.ГруппировкаТоварныхОграничений);
			КонецЕсли;
			
			НаборЗаписей.Записать();
			НаборЗаписей.Отбор.ГруппировкаТоварныхОграничений.Использование = Ложь;
			КоличествоЗаписей = КоличествоЗаписей + 1;
			
		КонецЦикла;
		
		ОбновитьРекомендацииПоИзменениюОбщихНастроек(ОбщиеНастройки, Группировки);
		ОбновитьРекомендацииПоИзменениюГруппировок(Группировки);
		
		Пока ВыборкаДляОбновленияДопРеквизита.Следующий() Цикл
			ОбновитьЗначенияРеквизитаДопУпорядочивания(ВыборкаДляОбновленияДопРеквизита.Номенклатура,
				ВыборкаДляОбновленияДопРеквизита.Характеристика);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись в регистр ""Товарные ограничения""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат КоличествоЗаписей;
КонецФункции

&Вместо ("РассчитатьСтатистикуПотребленияТоваров")
Процедура оп_РассчитатьСтатистикуПотребленияТоваров(МенеджерВременныхТаблиц) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецЕсли
&ИзменениеИКонтроль("ПустыеПараметрыТоварногоОграничения")
Функция Док_ПустыеПараметрыТоварногоОграничения()
	ПараметрыТоварногоОграничения = Новый Структура();
	ПараметрыТоварногоОграничения.Вставить("МетодОбеспеченияПотребностей",
		Перечисления.МетодыОбеспеченияПотребностей.ПустаяСсылка());
	ПараметрыТоварногоОграничения.Вставить("МинимальноеКоличествоЗапаса",	0);
	ПараметрыТоварногоОграничения.Вставить("МаксимальноеКоличествоЗапаса",	0);
	#Вставка
	ПараметрыТоварногоОграничения.Вставить("ПределМИН",						0);
	ПараметрыТоварногоОграничения.Вставить("ПределМАКС",					0);
	#КонецВставки
	ПараметрыТоварногоОграничения.Вставить("СтраховоеКоличествоЗапаса",		0);
	ПараметрыТоварногоОграничения.Вставить("НормаПотребления",				0);
	ПараметрыТоварногоОграничения.Вставить("ОбеспечениеЗаказовПриПоддержанииЗапаса",
		Перечисления.ОбеспечениеЗаказовПриПоддержанииЗапаса.ПустаяСсылка());

	Возврат ПараметрыТоварногоОграничения;
КонецФункции

&ИзменениеИКонтроль("ДобавитьПоддержаниеЗапасаМинМакс")
Процедура Док_ДобавитьПоддержаниеЗапасаМинМакс(КлючиЗаписи, ПараметрыМинМакс) Экспорт

	Если ТипЗнч(КлючиЗаписи) = Тип("Структура") Тогда
		Ключ = КлючиЗаписи;
		КлючиЗаписи = Новый Массив(1);
		КлючиЗаписи[0] = Ключ;
	КонецЕсли;

	ОбнулятьРанееЗаданныйМинМакс = Истина;
	Если ПараметрыМинМакс = Неопределено Тогда
		ОбнулятьРанееЗаданныйМинМакс = Ложь;
		ПараметрыМинМакс = ПараметрыМинМакс();
	КонецЕсли;

	ПараметрыДляЗаписи = ПустыеПараметрыТоварногоОграничения();
	#Удаление
	ЗаполнитьЗначенияСвойств(ПараметрыДляЗаписи, ПараметрыМинМакс, 
		"МинимальноеКоличествоЗапаса, МаксимальноеКоличествоЗапаса, ОбеспечениеЗаказовПриПоддержанииЗапаса");
	#КонецУдаления
	#Вставка	
	ЗаполнитьЗначенияСвойств(ПараметрыДляЗаписи, ПараметрыМинМакс,
		"МинимальноеКоличествоЗапаса, МаксимальноеКоличествоЗапаса, ПределМИН, ПределМАКС, ОбеспечениеЗаказовПриПоддержанииЗапаса");
	#КонецВставки	
	ПараметрыДляЗаписи.МетодОбеспеченияПотребностей = Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаМинМакс;

	ТаблицаТоваров		= ТаблицаТоваров();
	ТаблицаГруппировок	= ТаблицаГруппировок();
	Для каждого Ключ Из КлючиЗаписи Цикл
		Если Ключ.ТипКлюча = "ДетальнаяНастройка" Тогда
			ЗаписьТаблицы = ТаблицаТоваров.Добавить();
			ЗаписьТаблицы.Номенклатура		= Ключ.Номенклатура;
			ЗаписьТаблицы.Характеристика	= Ключ.Характеристика;
			ЗаписьТаблицы.Склад				= Ключ.Склад;
		ИначеЕсли Ключ.ТипКлюча = "ОбщаяНастройка" Тогда
			ЗаписьТаблицы = ТаблицаТоваров.Добавить();
			ЗаписьТаблицы.Номенклатура		= Ключ.Номенклатура;
			ЗаписьТаблицы.Склад				= Ключ.Склад;
		ИначеЕсли Ключ.ТипКлюча = "Группировка" Тогда
			ЗаписьТаблицы = ТаблицаГруппировок.Добавить();
			ЗаписьТаблицы.ГруппировкаТоварныхОграничений = Ключ.ГруппировкаТоварныхОграничений;
		Иначе
			ВызватьИсключение НСтр("ru = 'Недопустимый тип ключа записи!'");;
		КонецЕсли;
	КонецЦикла;

	Записать(ТаблицаТоваров, ТаблицаГруппировок, ПараметрыДляЗаписи, ОбнулятьРанееЗаданныйМинМакс);

КонецПроцедуры

&ИзменениеИКонтроль("ПараметрыМинМакс")
Функция Док_ПараметрыМинМакс() Экспорт
	Параметры = Новый Структура();
	Параметры.Вставить("МинимальноеКоличествоЗапаса",	0);
	Параметры.Вставить("МаксимальноеКоличествоЗапаса",	0);
	#Вставка
	Параметры.Вставить("ПределМИН",	0);
	Параметры.Вставить("ПределМАКС", 0);
	#КонецВставки
	Параметры.Вставить("ОбеспечениеЗаказовПриПоддержанииЗапаса",
		Перечисления.ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов);
	Возврат Параметры;
КонецФункции
